package com.fun.category.dao;

import java.util.List;

import com.fun.category.dto.CategoryDTO;

//------------------------------------------------------------------------------------------------------------
// public interface CategoryDAO
//------------------------------------------------------------------------------------------------------------

public interface CategoryDAO {

	//------------------------------------------------------------------------------------------------------------
	// 봄 카테고리 목록 띄우기
	//------------------------------------------------------------------------------------------------------------
	public List<CategoryDTO> SpringList() throws Exception;
	
} // End - public interface CategoryDAO
